* Backup my home directories 

** Setup
*** Define things to be backed up

    Define a list of things to be backed up.   These will be
    directories relative to root.

    #+name: backUpThese
    | old  |
    | data |
    | home |

*** Define some parameters

    Define some parameters.  First column is parameter name.  Second
    column is the value.  They will be evaled in bash.

    #+name: config
    | WHERE_TO | /big2/backups/octo/                     |
    | LOGDIR   | /home/george/projects/current/backups   |
    | EXCLUDE  | ${LOGDIR}/rsync.exclude                 |
    | LOGFILE  | ${LOGDIR}/rsync-octo-to-big2-${NOW}.log |
    | RUNFROM  | "/"                                     |


    
** Run the backups
   #+name: backups.<2015-07-18 Sat 06:03>
   #+begin_src sh :var names=config[,0] values=config[,1] :results output prepend :dir /sudo:: :exports both 
   exec 2>&1;set -e; set -u; set +x; echo '#' `date;`

   # pull the org variables into arrays
   configNames=($names)
   configValues=($values)
   len=${#configNames[@]}
   NOW=`date +%F-%T`
   
   # eval to set and echo the config variables
   for i in `seq 0 $((len - 1))`; do
     evalThis=${configNames[$i]}=${configValues[$i]}
     eval $evalThis
     echoThis="echo ${configNames[$i]}=\$${configNames[$i]}"
     eval $echoThis

   done

   echo NOW=$NOW

   touch $LOGFILE
   cd $RUNFROM

   for BACK_THIS_UP in old data home; do
     rsync -av  --exclude-from=$EXCLUDE $BACK_THIS_UP "$WHERE_TO" 2>&1 | grep -v '/$'  2>&1 | tee >> $LOGFILE || true
   done

   gzip $LOGFILE
   

   cd $LOGDIR
   chmod +r rsync*
   ls -lt rsync* | head


#+end_src

#+RESULTS: backups.<2015-07-18 Sat 06:03>
#+begin_example
# Sat Jul 18 06:24:03 EDT 2015
WHERE_TO=/big2/backups/octo/
LOGDIR=/home/george/projects/current/backups
EXCLUDE=/home/george/projects/current/backups/rsync.exclude
LOGFILE=/home/george/projects/current/backups/rsync-octo-to-big2-2015-07-18-06:24:03.log
RUNFROM=/
NOW=2015-07-18-06:24:03
-rw-r--r-- 1 root   root     17605 Jul 18 06:06 rsync-octo-to-big2-2015-07-18-06:04:00.log.gz
-rw-r--r-- 1 root   root     93363 Jul 12 20:15 rsync-octo-to-big2-2015-07-12-20:10:23.log.gz
-rw-r--r-- 1 root   root        63 Jul 12 20:06 rsync-octo-to-big2-2015-07-12-20:06:49.log.gz
-rw-r--r-- 1 root   root    120329 Jul  3 21:36 rsync-octo-to-big2-2015-07-03-21:30:51.log.gz
-rw-r--r-- 1 root   root       211 Jul  3 21:26 rsync-octo-to-big2-2015-07-03-21:26:14.log.gz
-rw-r--r-- 1 root   root      1367 Jun 30 16:05 rsync-octo-to-big2-2015-06-30-16:02:53.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:40.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:26.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:11.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:55 rsync-octo-to-big2-2015-06-30-15:55:36.log.gz
#+end_example
#+begin_example
# Sat Jul 18 06:22:08 EDT 2015
WHERE_TO=/big2/backups/octo/
LOGDIR=/home/george/projects/current/backups
EXCLUDE=/home/george/projects/current/backups/rsync.exclude
LOGFILE=/home/george/projects/current/backups/rsync-octo-to-big2-2015-07-18-06:22:08.log
RUNFROM=/
NOW=2015-07-18-06:22:08
-rw------- 1 root   root     17605 Jul 18 06:06 rsync-octo-to-big2-2015-07-18-06:04:00.log.gz
-rw-r--r-- 1 root   root     93363 Jul 12 20:15 rsync-octo-to-big2-2015-07-12-20:10:23.log.gz
-rw-r--r-- 1 root   root        63 Jul 12 20:06 rsync-octo-to-big2-2015-07-12-20:06:49.log.gz
-rw-r--r-- 1 root   root    120329 Jul  3 21:36 rsync-octo-to-big2-2015-07-03-21:30:51.log.gz
-rw-r--r-- 1 root   root       211 Jul  3 21:26 rsync-octo-to-big2-2015-07-03-21:26:14.log.gz
-rw-r--r-- 1 root   root      1367 Jun 30 16:05 rsync-octo-to-big2-2015-06-30-16:02:53.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:40.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:26.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:11.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:55 rsync-octo-to-big2-2015-06-30-15:55:36.log.gz
#+end_example
#+begin_example
# Sat Jul 18 06:04:00 EDT 2015
WHERE_TO=/big2/backups/octo/
LOGDIR=/home/george/projects/current/backups
EXCLUDE=/home/george/projects/current/backups/rsync.exclude
LOGFILE= /home/george/projects/current/backups/rsync-octo-to-big2-2015-07-18-06:04:00.log
RUNFROM=/
NOW=2015-07-18-06:04:00
-rw------- 1 root   root     17605 Jul 18 06:06 rsync-octo-to-big2-2015-07-18-06:04:00.log.gz
-rw-r--r-- 1 root   root     93363 Jul 12 20:15 rsync-octo-to-big2-2015-07-12-20:10:23.log.gz
-rw-r--r-- 1 root   root        63 Jul 12 20:06 rsync-octo-to-big2-2015-07-12-20:06:49.log.gz
-rw-r--r-- 1 root   root    120329 Jul  3 21:36 rsync-octo-to-big2-2015-07-03-21:30:51.log.gz
-rw-r--r-- 1 root   root       211 Jul  3 21:26 rsync-octo-to-big2-2015-07-03-21:26:14.log.gz
-rw-r--r-- 1 root   root      1367 Jun 30 16:05 rsync-octo-to-big2-2015-06-30-16:02:53.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:40.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:26.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:11.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:55 rsync-octo-to-big2-2015-06-30-15:55:36.log.gz
#+end_example
#+begin_example
# Tue Jun 30 16:02:53 EDT 2015
WHERE_TO=/big2/backups/octo/
LOGDIR=/home/george/projects/current/backups
EXCLUDE=/home/george/projects/current/backups/rsync.exclude
LOGFILE=/home/george/projects/current/backups/rsync-octo-to-big2-2015-06-30-16:02:53.log
RUNFROM=/
NOW=2015-06-30-16:02:53
-rw-r--r-- 1 root   root      1367 Jun 30 16:05 rsync-octo-to-big2-2015-06-30-16:02:53.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:40.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:26.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:58 rsync-octo-to-big2-2015-06-30-15:58:11.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:55 rsync-octo-to-big2-2015-06-30-15:55:36.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:31.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:30.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:29.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:27.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:26.log.gz
#+end_examplep
#+begin_example
# Tue Jun 30 15:52:31 EDT 2015
WHERE_TO=/big2/backups/octo/
LOGDIR=/home/george/projects/current/backups
EXCLUDE=/home/george/projects/current/backups/rsync.exclude
LOGFILE=/home/george/projects/current/backups/rsync-octo-to-big2-2015-06-30-15:52:31.log
RUNFROM=/
NOW=2015-06-30-15:52:31
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:31.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:30.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:29.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:27.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:26.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:08.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:07.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:52 rsync-octo-to-big2-2015-06-30-15:52:06.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:51 rsync-octo-to-big2-2015-06-30-15:51:54.log.gz
-rw-r--r-- 1 root   root        63 Jun 30 15:51 rsync-octo-to-big2-2015-06-30-15:51:47.log.gz
#+end_example

   #+name: backups.<2015-07-18 Sat 06:03>
   #+begin_src sh :var names=config[,0] values=config[,1] :results output prepend :dir /sudo:: :exports both 
   exec 2>&1;set -e; set -u; set +x; echo '#' `date;`

   # pull the org variables into arrays
   configNames=($names)
   configValues=($values)
   len=${#configNames[@]}
   NOW=`date +%F-%T`
   
   # eval to set and echo the config variables
   for i in `seq 0 $((len - 1))`; do
     evalThis=${configNames[$i]}=${configValues[$i]}
     eval $evalThis
     echoThis="echo ${configNames[$i]}=\$${configNames[$i]}"
     eval $echoThis

   done

   echo NOW=$NOW

   cd $LOGDIR
   chmod 644 rsync*
   ls -lt rsync* | head
   #+end_src


